/*********************************************************************************
*				                                         科东(广州)软件科技有限公司 版权所有
* 	 Copyright (C) 2021 Intewell (Guangzhou) Software Technology Co., Ltd. All Rights Reserved.
**********************************************************************************/

/*
 * 修改历史：
 * 2017-05-10     李燕, 科东（广州）软件科技有限公司
 *                创建该文件。
 *                
*/

/*
* @file：userAppInit.c
* @brief：
*	    <li>用户入口文件，userAppInit()是用户的入口函数。</li>
* @implements：
*/

/************************头 文 件******************************/
#include <commonTypes.h>
#include "stdio.h"

/************************宏 定 义******************************/
/************************类型定义******************************/
/************************外部声明******************************/
/************************前向声明******************************/
/************************模块变量******************************/
/************************全局变量******************************/
/************************实   现*******************************/
extern INT32 RTOS_WD_002(T_VOID);
extern INT32 RTOS_WD_003(T_VOID);
extern INT32 RTOS_WD_004_1(T_VOID);
extern INT32 RTOS_WD_009(T_VOID);
extern INT32 RTOS_WD_009_1(T_VOID);
extern INT32 RTOS_WD_009_2(T_VOID);
extern INT32 RTOS_WD_014(T_VOID);
extern INT32 RTOS_WD_014_1(T_VOID);
extern INT32 RTOS_WD_014_2(T_VOID);

int userAppInit(void)
{
	printf("\r\n    Reboot\r\n");
	RTOS_WD_002();
    return 0;
}

