/*********************************************************************************
 *				                                         科东(广州)软件科技有限公司 版权所有
 * 	 Copyright (C) 2021 Intewell (Guangzhou) Software Technology Co., Ltd. All Rights Reserved.
 **********************************************************************************/

/*
 * 修改历史：
 * 2017-05-10     李燕, 科东（广州）软件科技有限公司
 *                创建该文件。
 *                
 */

/*
 * @file：userAppInit.c
 * @brief：
 *	    <li>用户入口文件，userAppInit()是用户的入口函数。</li>
 * @implements：
 */

/************************头 文 件******************************/
#include <commonTypes.h>
#include<time.h>
#include<ttos.h>

/************************宏 定 义******************************/
/************************类型定义******************************/
/************************外部声明******************************/
/************************前向声明******************************/
/************************模块变量******************************/
/************************全局变量******************************/
/************************实   现*******************************/

int userAppInit(void) {
	T_UDWORD t1, t2;

	/* 获取两个时间点的间隔时间 */
	for (int i = 0; i < 10; i++) {

		t1 = TTOS_GetCurrentSystemCount();
		// 延迟函数

//		sleep(10);			// 秒
//		delayMS(1000);   // 毫秒
//		usleep(10);		// 微秒
//		delayUS(1000);	// 纳秒
		t2 = TTOS_GetCurrentSystemCount();
		printf("TTOS_GetCurrentSystemSubTime: %u. \n",
				TTOS_GetCurrentSystemSubTime(t1, t2, TTOS_US_UNIT));
	}
	return 0;
}
