/*********************************************************************************
*				                                         科东(广州)软件科技有限公司 版权所有
* 	 Copyright (C) 2021 Intewell (Guangzhou) Software Technology Co., Ltd. All Rights Reserved.
**********************************************************************************/

/*
 * 修改历史：
 * 2023-8-1     xx, 科东（广州）软件科技有限公司
 *                创建该文件。
 *                
*/

/*
* @file：userAppInit.c
* @brief：
*	    <li>用户入口文件，userAppInit()是用户的入口函数。</li>
* @implements：
*/
/************************宏 定 义******************************/
#define FAR
/************************头 文 件******************************/
#include <commonTypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <symtab.h>
#include <pthread.h>
/************************类型定义******************************/
/************************外部声明******************************/
extern void testAPPDynamicLoad(const char *app_name);
extern int app_main(int argc, char *argv[]);

/************************前向声明******************************/
/************************模块变量******************************/
/************************全局变量******************************/
/************************实   现*******************************/

int userAppInit(void)
{
	//调用testAPPDynamicLoad，传入应用的文件名，即可动态加载应用
    return 0;
}

