/*********************************************************************************
*				                                         科东(广州)软件科技有限公司 版权所有
* 	 Copyright (C) 2021 Intewell (Guangzhou) Software Technology Co., Ltd. All Rights Reserved.
**********************************************************************************/

/*
 * 修改历史：
 * 2017-05-10     李燕, 科东（广州）软件科技有限公司
 *                创建该文件。
 *                
*/

/*
* @file：userAppInit.c
* @brief：
*	    <li>用户入口文件，userAppInit()是用户的入口函数。</li>
* @implements：
*/

/************************头 文 件******************************/
#include <commonTypes.h>
#include <rtdev.h>
#include <ttos.h>
#include <pthread.h>
pthread_t ThreadId1;
extern TOOL_CT_PER_0012();

/************************宏 定 义******************************/
/************************类型定义******************************/
/************************外部声明******************************/
/************************前向声明******************************/
/************************模块变量******************************/
/************************全局变量******************************/
/************************实   现*******************************/

int userAppInit(void)
{
	T_WORD ret1;
	TTOS_CPUStatisticsDisable();

	ret1 = pthread_create(&ThreadId1, NULL, TOOL_CT_PER_0012, NULL);/*实时端定时器抖动*/
	if (ret1 != 0) {
		printf("func: %s, line: %d, create thread failed  !!!\n", __FUNCTION__, __LINE__);
		return -1;
	}

    return 0;
}

