/***************************************************************************
*				科东(广州)软件科技有限公司 版权所有
* 	 Copyright (C) 2011 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/
/**
* @file: configTTS.h
* @brief:
*        <li>时间表调度宏定义<li>
* @implements:
*/
#ifndef _CONFIGTTS_H
#define _CONFIGTTS_H


/************************头 文 件******************************/

#include	<svmk.h>

/************************宏 定 义******************************/

#define CONFIG_VMK_TTS_AUTO_START_NUMBER 0
#define CONFIG_VMK_TTS_NUMBER 1

/************************外部声明******************************/


/************************模块变量******************************/


/************************全局变量******************************/

#endif
