/*********************************************************************************
*				                                         科东(广州)软件科技有限公司 版权所有
* 	 Copyright (C) 2021 Intewell (Guangzhou) Software Technology Co., Ltd. All Rights Reserved.
**********************************************************************************/

/*
 * 修改历史：
 * 2017-05-10     李燕, 科东（广州）软件科技有限公司
 *                创建该文件。
 *                
*/

/*
* @file：userAppInit.c
* @brief：
*	    <li>用户入口文件，userAppInit()是用户的入口函数。</li>
* @implements：
*/

/************************头 文 件******************************/
#include <commonTypes.h>
#include <errno.h>
#include <sysGpio.h>
#include <fcntl.h>
#include<stdlib.h>


/************************宏 定 义******************************/
/************************类型定义******************************/
/************************外部声明******************************/
/************************前向声明******************************/
/************************模块变量******************************/
/************************全局变量******************************/
/************************实   现*******************************/


int userAppInit(void)
{

/*
 * 通过数组申请内存进行内存测试，使用malloc申请内存
 * 变量i：循环迭代数
 * 变量size：申请的内存的大小
 * 变量arry：数组变量
 *
 * */

	int i;
	int size=10;
	int *arry;

	// 申请内存
	arry=(int *)malloc(size*sizeof(int));

	if(arry==NULL){

		printf("malloc fail!\n");

	}else{

		printf("malloc success!\n");

	}

	// 将一个0-100的随机数赋值给arry[i]
	for(i=0;i<size;i++){

		arry[i]=(int)rand()%100;

	}

	// 打印数组中的每一个值
	printf("======================value======================\n");
	for(i=0;i<size;i++){

		printf("the %dth value: %d\n",i+1, *(arry+i));

	}


	// 打印数组中的每个地址
	printf("=====================address=====================\n");
	for(i=0;i<size;i++){

		printf("the %dth address: %p\n",i+1,&arry[i]);

	}

	printf("======================done======================\n");
	// 释放内存空间
	free(arry);
    return 0;
}

