/***************************************************************************
*				北京科银京成技术有限公司 版权所有
* 	 Copyright (C) 2011 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/
/**
* @file: configHACL.c
* @brief:
*        <li>目标板配置<li>
* @implements:
*/

/************************头 文 件******************************/

#include <svmk.h>
#include "configHACL.h"


/************************宏 定 义******************************/


/************************外部声明******************************/


/************************模块变量******************************/


/************************全局变量******************************/

/*虚拟中断映射表*/
T_VMK_ConfigKbsp configHaclTable=
{
    CONFIG_HACL_TIMER_ONESHOT,
    CONFIG_HACL_TIMER_MICROSECOND_PERTICKS
};

