/***************************************************************************
*				北京科银京成技术有限公司 版权所有
* 	 Copyright (C) 2011 CoreTek Systems Inc. All Rights Reserved.
***************************************************************************/
/**
* @file: configTTS.c
* @brief:
*        <li>时间表调度配置<li>
* @implements:
*/

/************************头 文 件******************************/

#include	<svmk.h>
#include	<configTTS.h>

/************************宏 定 义******************************/


/************************外部声明******************************/


/************************模块变量******************************/


/************************全局变量******************************/


/*时间调度表窗口配置*/
T_VMK_TTSNode vmkConfigTTS_tts1[2] =
{
    {(0),(0),(100)},/*vm1*/
    {0,0,0}		
};


/*时间调度表配置*/
T_VMK_ConfigTTSTable vmkConfigTTSTable[1] = 
{
    {"S1",10,200,vmkConfigTTS_tts1}
};


/*自动启动的时间调度表*/
T_VMK_ConfigAutoStartedTTSTable vmkConfigAutoStartedTTS[CONFIG_VMK_TTS_AUTO_START_NUMBER] = 
{
};

